Дошкольное_учреждение83/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/InformationRegisters/СведенияОПользователях/СведенияОПользователях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователях</name>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Catalogs/СтруктураПредприятия/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Руководитель) Тогда 
		МенеджерЗаписи = РегистрыСведений.СведенияОПользователях.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = Объект.Руководитель;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Подразделение <> ТекущийОбъект.Ссылка Тогда 
			МенеджерЗаписи.Пользователь = Объект.Руководитель;
			МенеджерЗаписи.Подразделение = ТекущийОбъект.Ссылка;
			МенеджерЗаписи.Записать();
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
